LuckiBit/stm32-template/bootloader/core/stm32f1xx_hal_conf.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    stm32f1xx_hal_conf.h
 * @brief   HAL configuration file.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2017 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F1xx_HAL_CONF_H
#define __STM32F1xx_HAL_CONF_H

#ifdef __cplusplus
extern "C"
{
#endif

    /* Exported types ------------------------------------------------------------*/
    /* Exported constants --------------------------------------------------------*/

    /* ########################## Module Selection ############################## */
    /**
     * @brief This is the list of modules to be used in the HAL driver
     */

/* Module switches: 1 = enabled, 0 = disabled. */
#define HAL_MODULE_ENABLE                1
#define HAL_ADC_MODULE_ENABLE            0
#define HAL_CRYP_MODULE_ENABLE           0
#define HAL_CAN_MODULE_ENABLE            0
#define HAL_CAN_LEGACY_MODULE_ENABLE     0
#define HAL_CEC_MODULE_ENABLE            0
#define HAL_CORTEX_MODULE_ENABLE         1
#define HAL_CRC_MODULE_ENABLE            0
#define HAL_DAC_MODULE_ENABLE            0
#define HAL_DMA_MODULE_ENABLE            1
#define HAL_ETH_MODULE_ENABLE            0
#define HAL_EXTI_MODULE_ENABLE           1
#define HAL_FLASH_MODULE_ENABLE          1
#define HAL_GPIO_MODULE_ENABLE           1
#define HAL_I2C_MODULE_ENABLE            0
#define HAL_I2S_MODULE_ENABLE            0
#define HAL_IRDA_MODULE_ENABLE           0
#define HAL_IWDG_MODULE_ENABLE           0
#define HAL_NOR_MODULE_ENABLE            0
#define HAL_NAND_MODULE_ENABLE           0
#define HAL_PCCARD_MODULE_ENABLE         0
#define HAL_PCD_MODULE_ENABLE            0
#define HAL_HCD_MODULE_ENABLE            0
#define HAL_PWR_MODULE_ENABLE            1
#define HAL_RCC_MODULE_ENABLE            1
#define HAL_RTC_MODULE_ENABLE            0
#define HAL_SD_MODULE_ENABLE             0
#define HAL_MMC_MODULE_ENABLE            0
#define HAL_SDRAM_MODULE_ENABLE          0
#define HAL_SMARTCARD_MODULE_ENABLE      0
#define HAL_SPI_MODULE_ENABLE            0
#define HAL_SRAM_MODULE_ENABLE           0
#define HAL_TIM_MODULE_ENABLE            0
#define HAL_UART_MODULE_ENABLE           0
#define HAL_USART_MODULE_ENABLE          0
#define HAL_WWDG_MODULE_ENABLE           0

/* Map module switches to the presence macros used by the HAL driver. */
#if HAL_MODULE_ENABLE
#define HAL_MODULE_ENABLED
#endif

#if HAL_ADC_MODULE_ENABLE
#define HAL_ADC_MODULE_ENABLED
#endif

#if HAL_CRYP_MODULE_ENABLE
#define HAL_CRYP_MODULE_ENABLED
#endif

#if HAL_CAN_MODULE_ENABLE
#define HAL_CAN_MODULE_ENABLED
#endif

#if HAL_CAN_LEGACY_MODULE_ENABLE
#define HAL_CAN_LEGACY_MODULE_ENABLED
#endif

#if HAL_CEC_MODULE_ENABLE
#define HAL_CEC_MODULE_ENABLED
#endif

#if HAL_CORTEX_MODULE_ENABLE
#define HAL_CORTEX_MODULE_ENABLED
#endif

#if HAL_CRC_MODULE_ENABLE
#define HAL_CRC_MODULE_ENABLED
#endif

#if HAL_DAC_MODULE_ENABLE
#define HAL_DAC_MODULE_ENABLED
#endif

#if HAL_DMA_MODULE_ENABLE
#define HAL_DMA_MODULE_ENABLED
#endif

#if HAL_ETH_MODULE_ENABLE
#define HAL_ETH_MODULE_ENABLED
#endif

#if HAL_EXTI_MODULE_ENABLE
#define HAL_EXTI_MODULE_ENABLED
#endif

#if HAL_FLASH_MODULE_ENABLE
#define HAL_FLASH_MODULE_ENABLED
#endif

#if HAL_GPIO_MODULE_ENABLE
#define HAL_GPIO_MODULE_ENABLED
#endif

#if HAL_I2C_MODULE_ENABLE
#define HAL_I2C_MODULE_ENABLED
#endif

#if HAL_I2S_MODULE_ENABLE
#define HAL_I2S_MODULE_ENABLED
#endif

#if HAL_IRDA_MODULE_ENABLE
#define HAL_IRDA_MODULE_ENABLED
#endif

#if HAL_IWDG_MODULE_ENABLE
#define HAL_IWDG_MODULE_ENABLED
#endif

#if HAL_NOR_MODULE_ENABLE
#define HAL_NOR_MODULE_ENABLED
#endif

#if HAL_NAND_MODULE_ENABLE
#define HAL_NAND_MODULE_ENABLED
#endif

#if HAL_PCCARD_MODULE_ENABLE
#define HAL_PCCARD_MODULE_ENABLED
#endif

#if HAL_PCD_MODULE_ENABLE
#define HAL_PCD_MODULE_ENABLED
#endif

#if HAL_HCD_MODULE_ENABLE
#define HAL_HCD_MODULE_ENABLED
#endif

#if HAL_PWR_MODULE_ENABLE
#define HAL_PWR_MODULE_ENABLED
#endif

#if HAL_RCC_MODULE_ENABLE
#define HAL_RCC_MODULE_ENABLED
#endif

#if HAL_RTC_MODULE_ENABLE
#define HAL_RTC_MODULE_ENABLED
#endif

#if HAL_SD_MODULE_ENABLE
#define HAL_SD_MODULE_ENABLED
#endif

#if HAL_MMC_MODULE_ENABLE
#define HAL_MMC_MODULE_ENABLED
#endif

#if HAL_SDRAM_MODULE_ENABLE
#define HAL_SDRAM_MODULE_ENABLED
#endif

#if HAL_SMARTCARD_MODULE_ENABLE
#define HAL_SMARTCARD_MODULE_ENABLED
#endif

#if HAL_SPI_MODULE_ENABLE
#define HAL_SPI_MODULE_ENABLED
#endif

#if HAL_SRAM_MODULE_ENABLE
#define HAL_SRAM_MODULE_ENABLED
#endif

#if HAL_TIM_MODULE_ENABLE
#define HAL_TIM_MODULE_ENABLED
#endif

#if HAL_UART_MODULE_ENABLE
#define HAL_UART_MODULE_ENABLED
#endif

#if HAL_USART_MODULE_ENABLE
#define HAL_USART_MODULE_ENABLED
#endif

#if HAL_WWDG_MODULE_ENABLE
#define HAL_WWDG_MODULE_ENABLED
#endif

/* ########################## Oscillator Values adaptation ####################*/
/**
 * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSE is used as system clock source, directly or through the PLL).
 */
#if !defined(HSE_VALUE)
#define HSE_VALUE 8000000U /*!< Value of the External oscillator in Hz */
#endif                     /* HSE_VALUE */

#if !defined(HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT 100U /*!< Time out for HSE start up, in ms */
#endif                           /* HSE_STARTUP_TIMEOUT */

/**
 * @brief Internal High Speed oscillator (HSI) value.
 *        This value is used by the RCC HAL module to compute the system frequency
 *        (when HSI is used as system clock source, directly or through the PLL).
 */
#if !defined(HSI_VALUE)
#define HSI_VALUE 8000000U /*!< Value of the Internal oscillator in Hz*/
#endif                     /* HSI_VALUE */

/**
 * @brief Internal Low Speed oscillator (LSI) value.
 */
#if !defined(LSI_VALUE)
#define LSI_VALUE 40000U /*!< LSI Typical Value in Hz */
#endif /* LSI_VALUE */   /*!< Value of the Internal Low Speed oscillator in Hz                     \
                              The real value may vary depending on the variations                  \
                              in voltage and temperature. */

/**
 * @brief External Low Speed oscillator (LSE) value.
 *        This value is used by the UART, RTC HAL module to compute the system frequency
 */
#if !defined(LSE_VALUE)
#define LSE_VALUE 32768U /*!< Value of the External oscillator in Hz*/
#endif                   /* LSE_VALUE */

#if !defined(LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT 5000U /*!< Time out for LSE start up, in ms */
#endif                            /* LSE_STARTUP_TIMEOUT */

/* Tip: To avoid modifying this file each time you need to use different HSE,
   ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/**
 * @brief This is the HAL system configuration section
 */
#define VDD_VALUE         3300U /*!< Value of VDD in mv */
#define TICK_INT_PRIORITY 15U   /*!< tick interrupt priority (lowest by default)  */
#define USE_RTOS          0U
#define PREFETCH_ENABLE   1U

#define USE_HAL_ADC_REGISTER_CALLBACKS       0U /* ADC register callback disabled       */
#define USE_HAL_CAN_REGISTER_CALLBACKS       0U /* CAN register callback disabled       */
#define USE_HAL_CEC_REGISTER_CALLBACKS       0U /* CEC register callback disabled       */
#define USE_HAL_DAC_REGISTER_CALLBACKS       0U /* DAC register callback disabled       */
#define USE_HAL_ETH_REGISTER_CALLBACKS       0U /* ETH register callback disabled       */
#define USE_HAL_HCD_REGISTER_CALLBACKS       0U /* HCD register callback disabled       */
#define USE_HAL_I2C_REGISTER_CALLBACKS       0U /* I2C register callback disabled       */
#define USE_HAL_I2S_REGISTER_CALLBACKS       0U /* I2S register callback disabled       */
#define USE_HAL_MMC_REGISTER_CALLBACKS       0U /* MMC register callback disabled       */
#define USE_HAL_NAND_REGISTER_CALLBACKS      0U /* NAND register callback disabled      */
#define USE_HAL_NOR_REGISTER_CALLBACKS       0U /* NOR register callback disabled       */
#define USE_HAL_PCCARD_REGISTER_CALLBACKS    0U /* PCCARD register callback disabled    */
#define USE_HAL_PCD_REGISTER_CALLBACKS       0U /* PCD register callback disabled       */
#define USE_HAL_RTC_REGISTER_CALLBACKS       0U /* RTC register callback disabled       */
#define USE_HAL_SD_REGISTER_CALLBACKS        0U /* SD register callback disabled        */
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS 0U /* SMARTCARD register callback disabled */
#define USE_HAL_IRDA_REGISTER_CALLBACKS      0U /* IRDA register callback disabled      */
#define USE_HAL_SRAM_REGISTER_CALLBACKS      0U /* SRAM register callback disabled      */
#define USE_HAL_SPI_REGISTER_CALLBACKS       0U /* SPI register callback disabled       */
#define USE_HAL_TIM_REGISTER_CALLBACKS       0U /* TIM register callback disabled       */
#define USE_HAL_UART_REGISTER_CALLBACKS      0U /* UART register callback disabled      */
#define USE_HAL_USART_REGISTER_CALLBACKS     0U /* USART register callback disabled     */
#define USE_HAL_WWDG_REGISTER_CALLBACKS      0U /* WWDG register callback disabled      */

/* ########################## Assert Selection ############################## */
/**
 * @brief Uncomment the line below to expanse the "assert_param" macro in the
 *        HAL drivers code
 */
/* #define USE_FULL_ASSERT    1U */

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0 2U
#define MAC_ADDR1 0U
#define MAC_ADDR2 0U
#define MAC_ADDR3 0U
#define MAC_ADDR4 0U
#define MAC_ADDR5 0U

/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE ETH_MAX_PACKET_SIZE /* buffer size for receive               */
#define ETH_TX_BUF_SIZE ETH_MAX_PACKET_SIZE /* buffer size for transmit              */
#define ETH_RXBUFNB     8U                  /* 4 Rx buffers of size ETH_RX_BUF_SIZE  */
#define ETH_TXBUFNB     4U                  /* 4 Tx buffers of size ETH_TX_BUF_SIZE  */

/* Section 2: PHY configuration section */

/* DP83848_PHY_ADDRESS Address*/
#define DP83848_PHY_ADDRESS 0x01U
/* PHY Reset delay these values are based on a 1 ms Systick interrupt*/
#define PHY_RESET_DELAY 0x000000FFU
/* PHY Configuration delay */
#define PHY_CONFIG_DELAY 0x00000FFFU

#define PHY_READ_TO  0x0000FFFFU
#define PHY_WRITE_TO 0x0000FFFFU

    /* Section 3: Common PHY Registers */

#define PHY_BCR ((uint16_t)0x00) /*!< Transceiver Basic Control Register   */
#define PHY_BSR ((uint16_t)0x01) /*!< Transceiver Basic Status Register    */

#define PHY_RESET                   ((uint16_t)0x8000) /*!< PHY Reset */
#define PHY_LOOPBACK                ((uint16_t)0x4000) /*!< Select loop-back mode */
#define PHY_FULLDUPLEX_100M         ((uint16_t)0x2100) /*!< Set the full-duplex mode at 100 Mb/s */
#define PHY_HALFDUPLEX_100M         ((uint16_t)0x2000) /*!< Set the half-duplex mode at 100 Mb/s */
#define PHY_FULLDUPLEX_10M          ((uint16_t)0x0100) /*!< Set the full-duplex mode at 10 Mb/s  */
#define PHY_HALFDUPLEX_10M          ((uint16_t)0x0000) /*!< Set the half-duplex mode at 10 Mb/s  */
#define PHY_AUTONEGOTIATION         ((uint16_t)0x1000) /*!< Enable auto-negotiation function     */
#define PHY_RESTART_AUTONEGOTIATION ((uint16_t)0x0200) /*!< Restart auto-negotiation function */
#define PHY_POWERDOWN               ((uint16_t)0x0800) /*!< Select the power down mode           */
#define PHY_ISOLATE                 ((uint16_t)0x0400) /*!< Isolate PHY from MII                 */

#define PHY_AUTONEGO_COMPLETE ((uint16_t)0x0020) /*!< Auto-Negotiation process completed   */
#define PHY_LINKED_STATUS     ((uint16_t)0x0004) /*!< Valid link established               */
#define PHY_JABBER_DETECTION  ((uint16_t)0x0002) /*!< Jabber condition detected            */

/* Section 4: Extended PHY Registers */
#define PHY_SR ((uint16_t)0x10U) /*!< PHY status register Offset                      */

#define PHY_SPEED_STATUS ((uint16_t)0x0002U) /*!< PHY Speed mask */
#define PHY_DUPLEX_STATUS                                                                          \
    ((uint16_t)0x0004U) /*!< PHY Duplex mask                                 */

    /* ################## SPI peripheral configuration ########################## */

    /* CRC FEATURE: Use to activate CRC feature inside HAL SPI Driver
     * Activated: CRC code is present inside driver
     * Deactivated: CRC code cleaned from driver
     */

#define USE_SPI_CRC 0U

    /* Includes ------------------------------------------------------------------*/
    /**
     * @brief Include module's header file
     */

#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32f1xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32f1xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32f1xx_hal_exti.h"
#endif /* HAL_EXTI_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32f1xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_ETH_MODULE_ENABLED
#include "stm32f1xx_hal_eth.h"
#endif /* HAL_ETH_MODULE_ENABLED */

#ifdef HAL_CAN_MODULE_ENABLED
#include "stm32f1xx_hal_can.h"
#endif /* HAL_CAN_MODULE_ENABLED */

#ifdef HAL_CAN_LEGACY_MODULE_ENABLED
#include "legacy/stm32f1xx_hal_can_legacy.h"
#endif /* HAL_CAN_LEGACY_MODULE_ENABLED */

#ifdef HAL_CEC_MODULE_ENABLED
#include "stm32f1xx_hal_cec.h"
#endif /* HAL_CEC_MODULE_ENABLED */

#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32f1xx_hal_cortex.h"
#endif /* HAL_CORTEX_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32f1xx_hal_adc.h"
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_CRC_MODULE_ENABLED
#include "stm32f1xx_hal_crc.h"
#endif /* HAL_CRC_MODULE_ENABLED */

#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32f1xx_hal_dac.h"
#endif /* HAL_DAC_MODULE_ENABLED */

#ifdef HAL_FLASH_MODULE_ENABLED
#include "stm32f1xx_hal_flash.h"
#endif /* HAL_FLASH_MODULE_ENABLED */

#ifdef HAL_SRAM_MODULE_ENABLED
#include "stm32f1xx_hal_sram.h"
#endif /* HAL_SRAM_MODULE_ENABLED */

#ifdef HAL_NOR_MODULE_ENABLED
#include "stm32f1xx_hal_nor.h"
#endif /* HAL_NOR_MODULE_ENABLED */

#ifdef HAL_I2C_MODULE_ENABLED
#include "stm32f1xx_hal_i2c.h"
#endif /* HAL_I2C_MODULE_ENABLED */

#ifdef HAL_I2S_MODULE_ENABLED
#include "stm32f1xx_hal_i2s.h"
#endif /* HAL_I2S_MODULE_ENABLED */

#ifdef HAL_IWDG_MODULE_ENABLED
#include "stm32f1xx_hal_iwdg.h"
#endif /* HAL_IWDG_MODULE_ENABLED */

#ifdef HAL_PWR_MODULE_ENABLED
#include "stm32f1xx_hal_pwr.h"
#endif /* HAL_PWR_MODULE_ENABLED */

#ifdef HAL_RTC_MODULE_ENABLED
#include "stm32f1xx_hal_rtc.h"
#endif /* HAL_RTC_MODULE_ENABLED */

#ifdef HAL_PCCARD_MODULE_ENABLED
#include "stm32f1xx_hal_pccard.h"
#endif /* HAL_PCCARD_MODULE_ENABLED */

#ifdef HAL_SD_MODULE_ENABLED
#include "stm32f1xx_hal_sd.h"
#endif /* HAL_SD_MODULE_ENABLED */

#ifdef HAL_NAND_MODULE_ENABLED
#include "stm32f1xx_hal_nand.h"
#endif /* HAL_NAND_MODULE_ENABLED */

#ifdef HAL_SPI_MODULE_ENABLED
#include "stm32f1xx_hal_spi.h"
#endif /* HAL_SPI_MODULE_ENABLED */

#ifdef HAL_TIM_MODULE_ENABLED
#include "stm32f1xx_hal_tim.h"
#endif /* HAL_TIM_MODULE_ENABLED */

#ifdef HAL_UART_MODULE_ENABLED
#include "stm32f1xx_hal_uart.h"
#endif /* HAL_UART_MODULE_ENABLED */

#ifdef HAL_USART_MODULE_ENABLED
#include "stm32f1xx_hal_usart.h"
#endif /* HAL_USART_MODULE_ENABLED */

#ifdef HAL_IRDA_MODULE_ENABLED
#include "stm32f1xx_hal_irda.h"
#endif /* HAL_IRDA_MODULE_ENABLED */

#ifdef HAL_SMARTCARD_MODULE_ENABLED
#include "stm32f1xx_hal_smartcard.h"
#endif /* HAL_SMARTCARD_MODULE_ENABLED */

#ifdef HAL_WWDG_MODULE_ENABLED
#include "stm32f1xx_hal_wwdg.h"
#endif /* HAL_WWDG_MODULE_ENABLED */

#ifdef HAL_PCD_MODULE_ENABLED
#include "stm32f1xx_hal_pcd.h"
#endif /* HAL_PCD_MODULE_ENABLED */

#ifdef HAL_HCD_MODULE_ENABLED
#include "stm32f1xx_hal_hcd.h"
#endif /* HAL_HCD_MODULE_ENABLED */

#ifdef HAL_MMC_MODULE_ENABLED
#include "stm32f1xx_hal_mmc.h"
#endif /* HAL_MMC_MODULE_ENABLED */

/* Exported macro ------------------------------------------------------------*/
#ifdef USE_FULL_ASSERT
/**
 * @brief  The assert_param macro is used for function's parameters check.
 * @param  expr If expr is false, it calls assert_failed function
 *         which reports the name of the source file and the source
 *         line number of the call that failed.
 *         If expr is true, it returns no value.
 * @retval None
 */
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
    /* Exported functions ------------------------------------------------------- */
    void assert_failed(uint8_t *file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

#ifdef __cplusplus
}
#endif

#endif /* __STM32F1xx_HAL_CONF_H */
